{
    "nomeperfil" : "Guilherme Costa Manrique",
    "imagemsrc" : "Visualizacao/Imagens/01GuilhermeManrique.jpeg",
    "imagemdescricao" : "Imagem Guilherme Costa Manrique",
    "apresentacaoperfil" : "<br/>Meu nome é Guilherme Costa Manrique, e sou o responsável pelo desenvolvimento desta página. O objetivo aqui é compartilhar um pouco das minhas habilidades, conhecimentos e experiências profissionais.<br/><br/>Sou formado em <strong>Análise e Desenvolvimento de Sistemas</strong> e possuo cerca de dois anos de experiência como desenvolvedor full stack. Tenho sólidos conhecimentos em <strong>ASP.NET</strong> e frameworks relacionados, como <strong>Entity Framework</strong>, <strong>FluentValidation</strong> e <strong>Bootstrap</strong>.<br/><br/>Atualmente, estou em busca de uma nova oportunidade no mercado de trabalho e espero que este site ajude a apresentar um pouco mais sobre mim e meu trabalho.<br/><br/>Caso tenha interesse em conversar, deixei meus contatos disponíveis. Ficarei feliz em trocar ideias!",
    "numerowhatsapp" : "+55 11 98157-2382",
    "linkwhatsapp" : "https://wa.me/5511981572382/?text=Ol%C3%A1%20Guilherme%21%20Localizei%20seu%20curr%C3%ADculo%20atrav%C3%A9s%20do%20GitHub.",
    "nomelinkedin" : "gcostamanrique",
    "linklinkedin" : "https://www.linkedin.com/in/guilherme-manrique",
    "nomegithub" : "gcostamanrique",
    "linkgithub" : "https://github.com/gcostamanrique",
    "email" : "gcostamanrique@gmail.com",
    "localizacao" : [
        {
            "titulo" : "Localização",
            "texto" : "Vila Santana - São Paulo - SP"
        }
    ],
    "habilidade" : [
        {
            "titulo" : "Prudência",
            "texto" : "Tomo decisões ponderadas, avaliando riscos e consequências, para garantir resultados sustentáveis e bem fundamentados."
        },
        {
            "titulo" : "Ética",
            "texto" : "Mantenho uma postura íntegra e responsável, sempre priorizando a transparência e a honestidade em todas as ações."
        },
        {
            "titulo" : "Aprendizado Contínuo",
            "texto" : "Busco constantemente expandir meus conhecimentos e habilidades, mantendo-me atualizado e pronto para enfrentar novos desafios."
        },
        {
            "titulo" : "Empatia",
            "texto" : "Me coloco no lugar dos outros, buscando compreender suas perspectivas e emoções, o que fortalece a colaboração e o respeito mútuo."
        },
        {
            "titulo" : "Trabalho em Equipe",
            "texto" : "Acredito que o sucesso vem da colaboração eficaz, onde a união de habilidades e esforços de todos leva a resultados superiores."
        },
        {
            "titulo" : "Equilíbrio Emocional",
            "texto" : "Mantenho a calma e a clareza de pensamento, mesmo em situações desafiadoras, permitindo-me tomar decisões racionais e assertivas."
        },
        {
            "titulo" : "Adaptabilidade",
            "texto" : "Estou sempre pronto para ajustar estratégias e abordagens conforme as circunstâncias mudam, com foco na solução de problemas."
        },
        {
            "titulo" : "Boa Comunicação",
            "texto" : "Expresso minhas ideias de maneira clara e assertiva, garantindo que todos os envolvidos compreendam as informações essenciais."
        },
        {
            "titulo" : "Pensamento Crítico",
            "texto" : "Analiso problemas e informações de forma lógica e detalhada, buscando soluções inovadoras e fundamentadas para situações complexas."
        }
    ],
    "formacao" : [
        {
            "titulo" : "Centro Universitário Senac",
            "subtitulo" : "Análise e Desenvolvimento de Sistemas",
            "periodo" : "2021 / 2023 (Concluído)",
            "texto" : "Durante a graduação em Análise e Desenvolvimento de Sistemas, foram estudados diversos aspectos fundamentais da computação, abrangendo desde lógica de programação até o desenvolvimento de aplicações web e a estruturação de bancos de dados.<br><br>A linguagem Java foi utilizada como base para consolidar conceitos de programação, possibilitando a criação de diferentes tipos de aplicações, a análise de softwares existentes, a produção de testes unitários e a adoção de padrões de desenvolvimento.<br><br>Além disso, foram abordados temas relacionados à análise de requisitos, destacando a importância de compreender e implementar soluções de forma eficiente e segura.<br><br>Também foram exploradas as etapas do ciclo de desenvolvimento de software, com foco na organização e estruturação adequada das aplicações.<br><br>No que se refere a bancos de dados, a formação incluiu a criação, manipulação e conexão de sistemas com bancos relacionais, visando otimizar a funcionalidade e a eficiência das aplicações.<br><br>O desenvolvimento web também esteve presente na grade curricular, com o estudo de frameworks como Spring e Bootstrap, proporcionando uma base sólida para a construção de aplicações modernas.<br><br>Além da parte voltada ao desenvolvimento de software, a graduação também abrangeu conceitos de hardware, proporcionando uma visão mais ampla sobre o funcionamento dos sistemas computacionais e sua integração com o software.<br><br>Essa abordagem contribuiu para uma compreensão mais completa dos fundamentos da computação e da importância da escolha adequada da arquitetura para cada solução tecnológica."
        }
    ],
    "experiencia" : [
        {
            "titulo" : "IGB - Industria Gráfica Brasileira",
            "subtitulo" : "Analista de desenvolvimento full stack",
            "periodo" : "PJ 2024 / 2024",
            "texto" : "Como analista de sistemas, fui responsável pelo desenvolvimento, manutenção e aprimoramento de aplicações web utilizando o framework ASP.NET. Ao longo desse processo, utilizei ferramentas e tecnologias como Entity Framework, Bootstrap, Datatables e FluentValidation para garantir a funcionalidade e a performance das soluções entregues.<br><br>Além do desenvolvimento das aplicações, desempenhei um papel importante na criação, manutenção e melhoria de tabelas e procedimentos armazenados em bancos de dados como SQL Server, MySQL e PostgreSQL. Esse trabalho envolvia a otimização constante das estruturas de dados, visando sempre a eficiência e a integridade das informações.<br><br>Outra parte fundamental da minha função envolvia a resolução de chamados internos e o desenvolvimento de novos projetos. Também ofereci suporte à equipe de desenvolvimento, contribuindo com soluções técnicas e colaborando para o andamento dos projetos.<br><br>Durante todas essas atividades, segui rigorosamente as normas de desenvolvimento seguro estabelecidas pela ISO 27000, garantindo que as políticas internas fossem cumpridas e, assim, mantendo as certificações de segurança da organização."
        },
        {
            "titulo" : "GGP Associados e Consultoria",
            "subtitulo" : "Assistente de desenvolvimento full stack",
            "periodo" : "CLT - 2022 / 2023",
            "texto" : "Como assistente de desenvolvimento, fui responsável pela análise, depuração e correção de logs de erros, garantindo que as aplicações funcionassem de maneira eficiente e sem falhas. Esse trabalho exigia atenção aos detalhes e uma abordagem sistemática para identificar e resolver problemas rapidamente.<br><br>Além disso, realizava manutenção nas aplicações existentes, propondo novas funcionalidades e melhorias que contribuíssem para a evolução contínua das soluções oferecidas. A constante busca por inovações e melhorias era um aspecto fundamental da minha atuação.<br><br>Outra parte importante das minhas funções era a solução de chamados internos e externos relacionados às aplicações em funcionamento. Isso envolvia a comunicação constante com outras equipes e usuários para garantir a resolução eficiente de problemas.<br><br>Durante todas essas atividades, utilizei tecnologias como ASP.NET e SQL Server, aplicando meus conhecimentos nessas ferramentas para entregar soluções de alta qualidade e manter a estabilidade dos sistemas."
        }
    ],
    "conhecimentoProjeto" : [
        {
            "texto" : "ASP.NET Core MVC"
        },
        {
            "texto" : "ASP.NET Core API Web"
        },
        {
            "texto" : "Windows Forms .NET"
        },
        {
            "texto" : "Aplicativos do Console"
        },
        {
            "texto" : "Bibliotecas de Classes"
        },
        {
            "texto" : "Projeto de Teste XUnit"
        }
    ],
    "conhecimentoBancoDados" : [
        {
            "texto" : "SQL Server"
        },
        {
            "texto" : "MySQL"
        },
        {
            "texto" : "PostgreSQL"
        }
    ],
    "conhecimentoFerramenta" : [
        {
            "texto" : "Visual Studio"
        },
        {
            "texto" : "Visual Studio Code"
        },
        {
            "texto" : "SQL Server Configuration Manager"
        },
        {
            "texto" : "SQL Server Management Studio"
        },
        {
            "texto" : "PgAdmin"
        },
        {
            "texto" : "MySQL Workbench"
        },
        {
            "texto" : "GIT"
        },
        {
            "texto" : "GitHub Desktop"
        },
        {
            "texto" : "Postman"
        }
    ],
    "conhecimentoFramework" : [
        {
            "texto" : "Entity Framework"
        },
        {
            "texto" : "FluentValidation"
        },
        {
            "texto" : "Newtonsoft Json"
        },
        {
            "texto" : "Bootstrap"
        },
        {
            "texto" : "JQuery e Datatables"
        },
        {
            "texto" : "Ajax e Fetch"
        }
    ],
    "conhecimentoPadraoProjeto" : [
        {
            "texto" : "Repository"
        },
        {
            "texto" : "Unit Of Work"
        },
        {
            "texto" : "Factory"
        },
        {
            "texto" : "Strategy"
        },
        {
            "texto" : "Observer"
        }
    ],
    "projeto" : [
        {
            "titulo" : "AutoresEFrases",
            "texto" : "AutoresEFrases é um projeto desenvolvido em ASP.NET Core MVC que permite pesquisar e incluir autores e frases em um banco de dados SQL Server.",
            "link" : "https://github.com/gcostamanrique/AutoresEFrases"
        },
        {
            "titulo" : "TheRickAndMortyAPI",
            "texto" : "O objetivo do TheRickAndMortyAPI é demonstrar algumas técnicas de consulta em JavaScript, ordenação e apresentação de dados utilizando o DataTable.",
            "link" : "https://github.com/gcostamanrique/TheRickAndMortyAPI"
        }
    ]
}
