{
    "nomeperfil" : "Guilherme Costa Manrique",
    "imagemsrc" : "Visualizacao/Imagens/01GuilhermeManrique.jpeg",
    "imagemdescricao" : "Imagem Guilherme Costa Manrique",
    "apresentacaoperfil" : "Olá! Meu nome é Guilherme Costa Manrique, e sou o responsável pelo desenvolvimento desta página. O objetivo aqui é compartilhar um pouco das minhas habilidades, conhecimentos e experiências profissionais. Sou formado em Análise e Desenvolvimento de Sistemas e possuo cerca de dois anos de experiência como desenvolvedor full stack. Tenho sólidos conhecimentos em ASP.NET e frameworks relacionados, como Entity Framework, Angular e Bootstrap. Atualmente, estou em busca de uma nova oportunidade no mercado de trabalho e espero que este site ajude a apresentar um pouco mais sobre mim e meu trabalho. Caso tenha interesse em conversar, deixei meus contatos disponíveis. Ficarei feliz em trocar ideias!",
    "numerowhatsapp" : "+55 11 98157-2382",
    "linkwhatsapp" : "https://wa.me/5511981572382/?text=Ol%C3%A1%20Guilherme%21%20Localizei%20seu%20curr%C3%ADculo%20atrav%C3%A9s%20do%20GitHub.",
    "nomelinkedin" : "gcostamanrique",
    "linklinkedin" : "https://www.linkedin.com/in/guilherme-manrique",
    "nomegithub" : "gcostamanrique",
    "linkgithub" : "https://github.com/gcostamanrique",
    "email" : "gcostamanrique@gmail.com",
    "localizacao" : [
        {
            "titulo" : "Localização",
            "texto" : "Vila Santana - São Paulo - SP"
        }
    ],
    "habilidade" : [
        {
            "titulo" : "Prudência",
            "texto" : "Tomo decisões ponderadas, avaliando riscos e consequências, para garantir resultados sustentáveis e bem fundamentados."
        },
        {
            "titulo" : "Ética",
            "texto" : "Mantenho uma postura íntegra e responsável, sempre priorizando a transparência e a honestidade em todas as ações."
        },
        {
            "titulo" : "Aprendizado Contínuo",
            "texto" : "Busco constantemente expandir meus conhecimentos e habilidades, mantendo-me atualizado e pronto para enfrentar novos desafios."
        },
        {
            "titulo" : "Empatia",
            "texto" : "Me coloco no lugar dos outros, buscando compreender suas perspectivas e emoções, o que fortalece a colaboração e o respeito mútuo."
        },
        {
            "titulo" : "Trabalho em Equipe",
            "texto" : "Acredito que o sucesso vem da colaboração eficaz, onde a união de habilidades e esforços de todos leva a resultados superiores."
        },
        {
            "titulo" : "Equilíbrio Emocional",
            "texto" : "Mantenho a calma e a clareza de pensamento, mesmo em situações desafiadoras, permitindo-me tomar decisões racionais e assertivas."
        },
        {
            "titulo" : "Adaptabilidade",
            "texto" : "Estou sempre pronto para ajustar estratégias e abordagens conforme as circunstâncias mudam, com foco na solução de problemas."
        },
        {
            "titulo" : "Boa Comunicação",
            "texto" : "Expresso minhas ideias de maneira clara e assertiva, garantindo que todos os envolvidos compreendam as informações essenciais."
        },
        {
            "titulo" : "Pensamento Crítico",
            "texto" : "Analiso problemas e informações de forma lógica e detalhada, buscando soluções inovadoras e fundamentadas para situações complexas."
        }
    ],
    "formacao" : [
        {
            "titulo" : "Centro Universitário Senac",
            "subtitulo" : "Análise e Desenvolvimento de Sistemas",
            "periodo" : "2021 / 2023 (Concluído)",
            "texto" : "Utilizando Java como linguagem principal, o curso proporcionou o aprendizado de desenvolvimento, modificação, depuração e teste de aplicações. Também foram abordados temas como arquitetura de computadores, arquitetura de software, criação e manipulação de bancos de dados, padrões de projeto, tecnologias amplamente utilizadas no mercado e novas tecnologias em desenvolvimento."
        }
    ],
    "experiencia" : [
        {
            "titulo" : "IGB - Industria Gráfica Brasileira",
            "subtitulo" : "Analista de desenvolvimento full stack",
            "periodo" : "PJ 2024 / 2024",
            "texto" : "Minhas responsabilidades incluíam a análise, desenvolvimento e manutenção de aplicações web e APIs desenvolvidas em ASP.NET Core, utilizando o Entity Framework como ORM. Também realizava manipulação, manutenção e criação de tabelas e procedimentos armazenados em bancos de dados SQL Server e PostgreSQL. Além disso, seguíamos as normas de segurança estabelecidas pela ISO 27000, conforme as políticas internas, para garantir o desenvolvimento seguro e manter a certificação da empresa na manipulação de dados sensíveis."
        },
        {
            "titulo" : "GGP Associados e Consultoria",
            "subtitulo" : "Assistente de desenvolvimento full stack",
            "periodo" : "CLT - 2022 / 2023",
            "texto" : "Minhas responsabilidades incluíam a análise, depuração e correção de logs, desenvolvimento de novas funcionalidades em aplicações existentes do tipo ASP.NET Core, atendimento a chamados internos e externos relacionados às aplicações, além da criação, atualização e manutenção de tabelas e procedimentos armazenados em banco de dados SQL Server."
        }
    ],
    "conhecimentoProjeto" : [
        {
            "texto" : "ASP.NET Core MVC"
        },
        {
            "texto" : "ASP.NET Core API Web"
        },
        {
            "texto" : "Windows Forms .NET"
        },
        {
            "texto" : "Aplicativos do Console"
        },
        {
            "texto" : "Bibliotecas de Classes"
        },
        {
            "texto" : "Projeto de Teste XUnit"
        }
    ],
    "conhecimentoBancoDados" : [
        {
            "texto" : "SQL Server"
        },
        {
            "texto" : "MySQL"
        },
        {
            "texto" : "PostgreSQL"
        }
    ],
    "conhecimentoFerramenta" : [
        {
            "texto" : "Visual Studio"
        },
        {
            "texto" : "Visual Studio Code"
        },
        {
            "texto" : "SQL Server Configuration Manager"
        },
        {
            "texto" : "SQL Server Management Studio"
        },
        {
            "texto" : "PgAdmin"
        },
        {
            "texto" : "MySQL Workbench"
        },
        {
            "texto" : "GIT"
        },
        {
            "texto" : "GitHub Desktop"
        },
        {
            "texto" : "Postman"
        }
    ],
    "conhecimentoFramework" : [
        {
            "texto" : "Entity Framework"
        },
        {
            "texto" : "FluentValidation"
        },
        {
            "texto" : "Newtonsoft Json"
        },
        {
            "texto" : "Bootstrap"
        },
        {
            "texto" : "JQuery e Datatables"
        },
        {
            "texto" : "Ajax e Fetch"
        }
    ],
    "conhecimentoPadraoProjeto" : [
        {
            "texto" : "Repository"
        },
        {
            "texto" : "Unit Of Work"
        },
        {
            "texto" : "Factory"
        },
        {
            "texto" : "Strategy"
        },
        {
            "texto" : "Observer"
        }
    ],
    "projeto" : [
        {
            "titulo" : "AutoresEFrases",
            "texto" : "AutoresEFrases é um projeto desenvolvido em ASP.NET Core MVC que permite pesquisar e incluir autores e frases em um banco de dados SQL Server.",
            "link" : "https://github.com/gcostamanrique/AutoresEFrases"
        },
        {
            "titulo" : "TheRickAndMortyAPI",
            "texto" : "O objetivo do TheRickAndMortyAPI é demonstrar algumas técnicas de consulta em JavaScript, ordenação e apresentação de dados utilizando o DataTable.",
            "link" : "https://github.com/gcostamanrique/TheRickAndMortyAPI"
        }
    ]
}
